Revit 2027 API
Camera.HorizontalOffset Property
 Horizontal offset of the camera's view center from target, measured at target distance.
Namespace: Autodesk.Revit.DB.DirectContext3D
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double HorizontalOffset { get; set; }
Public Property HorizontalOffset As Double
	Get
	Set
public:
property double HorizontalOffset {
	double get ();
	void set (double value);
}
member HorizontalOffset : float with get, set
Property Value
Double
See Also
Reference
Camera Class
Autodesk.Revit.DB.DirectContext3D Namespace